# Dataframe
A Data frame is a two dimensional data structure i.e. data is aligned in tabular form in rows and columns.
Features:-
        # Potentially columns are of different types
        #size- Mutable
        # Label axis (rows, columns)    
        # Can perform Arithmatic operations on rows and columns

pandas.DataFrame-

A pandas.DataFrame can be created using following constructs:-

    pandas.DataFrame(data,index,columns,dtype,copy)
    pandas.DataFrame(data,rows,column,dtype)

# create DataFrame
A pandas.DataFrame can be created using following inputs:-

                1. Lists
                2. dictionary
                3. numpy ndarray
                4. Another DataFrame

In [1]:
import pandas as pd

# Sample data

In [6]:
# Lets create empty DataFrame
# data,index,column,dtype
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [8]:
print(pd.DataFrame())

Empty DataFrame
Columns: []
Index: []

In [9]:
type(pd.DataFrame())

pandas.core.frame.DataFrame

In [10]:
# Data Frame using Lists
d = [10,20,30,40,50]
pd.DataFrame(d)

    0
0  10
1  20
2  30
3  40
4  50

In [11]:
pd.Series(d)  # there is difference betn presentation of Series and DataFrame....
              # Series are not having the label but in case of dataframe there is label i.e. 
                # i.e. name given to column

0    10
1    20
2    30
3    40
4    50
dtype: int64

# Create a DataFrame using multiple list/list of lists

In [13]:
data = [['A',53],['B',51],['C',53]]
df = pd.DataFrame(data)
df

   0   1
0  A  53
1  B  51
2  C  53

In [14]:
# we can give our own index/label....rows
data = [['A',53],['B',51],['C',53]]
df = pd.DataFrame(data,index=[10,20,30])
df

    0   1
10  A  53
20  B  51
30  C  53

In [16]:
# if we want to assign the name to column
data = [['A',53],['B',51],['C',53]]
df = pd.DataFrame(data,index=[10,20,30],columns=['Name','Age'])
df

   Name  Age
10    A   53
20    B   51
30    C   53

# Create a DataFrame using Dictionary of  lists

In [17]:
data = {'Name':['Manjiri'],'Age':[28]}
df = pd.DataFrame(data)
df
# when we use dict as an input keys becomes column label

      Name  Age
0  Manjiri   28

In [18]:
data = {'Name':['Manjiri','Maya','Manorama','Mrunal'],'Age':[28,30,45,25]}
df = pd.DataFrame(data)
df

       Name  Age
0   Manjiri   28
1      Maya   30
2  Manorama   45
3    Mrunal   25

In [21]:
data = {'Name':['Manjiri','Maya','Manorama','Mrunal'],'Age':[28,30,45,25]}
df = pd.DataFrame(data)
df

       Name  Age
0   Manjiri   28
1      Maya   30
2  Manorama   45
3    Mrunal   25

In [22]:
# And in Series when we use dict as input keys becomes index.
data = {'Name':['Manjiri','Maya','Manorama','Mrunal'],'Age':[28,30,45,25]}
df = pd.Series(data)
df

Name    [Manjiri, Maya, Manorama, Mrunal]
Age                      [28, 30, 45, 25]
dtype: object

In [23]:
import pandas as pd

In [25]:
data = {'Name':['Manjiri','Maya','Manorama','Mrunal'],'Age':[28,30,45,25]}
df = pd.DataFrame(data,columns=['student_nm','Rank'])
df
## if we try to change column names in case of dictionary......it wont change

Empty DataFrame
Columns: [student_nm, Rank]
Index: []

In [26]:
data

{'Name': ['Manjiri', 'Maya', 'Manorama', 'Mrunal'], 'Age': [28, 30, 45, 25]}

In [30]:
df = pd.DataFrame(data)
df

       Name  Age
0   Manjiri   28
1      Maya   30
2  Manorama   45
3    Mrunal   25

# still i want to change name of column

In [31]:
# if i want to change column names use 'rename': interview question.
df.rename(columns={'Name':'Customer','Age':'ID'})

   Customer  ID
0   Manjiri  28
1      Maya  30
2  Manorama  45
3    Mrunal  25

In [32]:
import pandas as pd

In [34]:
df # here not permanently change column name in df to do that use inplace=True

       Name  Age
0   Manjiri   28
1      Maya   30
2  Manorama   45
3    Mrunal   25

In [36]:
df.rename(columns={'Name':'Customer','Age':'ID'},inplace=True)
df

   Customer  ID
0   Manjiri  28
1      Maya  30
2  Manorama  45
3    Mrunal  25

In [45]:
# when we r using dictionary and we want to use only one column then in columns give the column label we want.
data = {'Name':['Manjiri','Maya','Manorama','Mrunal'],'Age':[28,30,45,25]}
df = pd.DataFrame(data,columns=['Name'])
df

       Name
0   Manjiri
1      Maya
2  Manorama
3    Mrunal

In [46]:
# values in each row should match exactly otherwise exception

data = {'Name':['Manjiri','Maya','Manorama','Mrunal'],'Age':[28,30,45]}
df = pd.DataFrame(data)
df

ValueError: All arrays must be of the same length

In [55]:
# if we are giving extra index then will raise value error.

data = {'Name':['Manjiri','Maya','Manorama'],'Age':[28,30,45]}
df = pd.DataFrame(data,index=[1,2,3,4])
df

ValueError: Shape of passed values is (3, 2), indices imply (4, 2)

In [58]:
# list of lists: each list become a row

data = [['Jack','Steve','Rocky','Jam'],[28,56,48,35]]
df = pd.DataFrame(data,index=['student_nm','Rank'])
df

               0      1      2    3
student_nm  Jack  Steve  Rocky  Jam
Rank          28     56     48   35

In [59]:
# list of lists: each list become a row and if anything is missing in any row then
# will get None there

data = [['Jack','Steve','Rocky','Jam'],[28,56]]
df = pd.DataFrame(data,index=['student_nm','Rank'])
df

               0      1      2     3
student_nm  Jack  Steve  Rocky   Jam
Rank          28     56   None  None

In [2]:
import pandas as pd

In [3]:
data = [['Jack','Steve','Rocky','Jam'],[28,56,45]]
df = pd.DataFrame(data,index=['student_nm','Rank'],columns=list('abcd')) #columns=('a','b','c','d')
df

               a      b      c     d
student_nm  Jack  Steve  Rocky   Jam
Rank          28     56     45  None

In [4]:
# if we want to replace rows to column and viceversa

data = [['Jack','Steve','Rocky','Jam'],[28,56,45,67]]
df = pd.DataFrame(data,index=['student_nm','Rank']).T  # Transpose
df

  student_nm Rank
0       Jack   28
1      Steve   56
2      Rocky   45
3        Jam   67

In [6]:
data = [{'a':1,'b':2,'c':14},{'a':4,'b':7,'c':20}]
data

[{'a': 1, 'b': 2, 'c': 14}, {'a': 4, 'b': 7, 'c': 20}]

In [7]:
df = pd.DataFrame(data)
df

   a  b   c
0  1  2  14
1  4  7  20

In [10]:
# NaN stand for not a number-->missing entry
data = [{'a':10,'b':20},{'a':30,'b':40,'c':60}]
df = pd.DataFrame(data)
df

    a   b     c
0  10  20   NaN
1  30  40  60.0

In [11]:
data = [{'a':10,'b':20},{'c':30,'b':40,'d':60}]
df = pd.DataFrame(data,index=['first','second']) # if entry is not present then NaN
df

           a   b     c     d
first   10.0  20   NaN   NaN
second   NaN  40  30.0  60.0

In [13]:
data = [{'a':10,'b':20},{'a':30,'b':40,'c':60}]
# when we dont want column c then specify only required column
df = pd.DataFrame(data,index=['first','second'],columns=['a','b']) # if entry is not present then NaN
df

         a   b
first   10  20
second  30  40

In [14]:
data = [{'a':10,'b':20},{'a':30,'b':40,'c':60}]
# when we dont want column c then specify only required column ,if repeat we want column specify it 
df = pd.DataFrame(data,index=['first','second'],columns=['a','b','a']) # if entry is not present then NaN
df

         a   b   a
first   10  20  10
second  30  40  30

# create a DataFrame using dictionary of Series

In [16]:
import numpy as np
np.array([])

array([], dtype=float64)

In [19]:
pd.Series().dtype

C:\Users\Prerana\AppData\Local\Temp/ipykernel_11968/1607665066.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  pd.Series().dtype

dtype('float64')

In [21]:
pd.DataFrame().dtypes

Series([], dtype: object)

In [22]:
data = ({'one':pd.Series([1,2,3,4,5]),'two':pd.Series([4,5,6,7,8])})
df=pd.DataFrame(data)
df

   one  two
0    1    4
1    2    5
2    3    6
3    4    7
4    5    8

In [24]:
# want to create DataFrame using only Series
s = pd.Series([1,2,3,4])
df = pd.DataFrame(s,columns=['number'])
df

   number
0       1
1       2
2       3
3       4

In [25]:
# list of Series
data = [pd.Series([1,2,3,4,5]),pd.Series([1,2,3,4,5])]
df = pd.DataFrame(data)
df

   0  1  2  3  4
0  1  2  3  4  5
1  1  2  3  4  5

# Creating DF using ndarray

In [26]:
import numpy as np

In [27]:
a = np.arange(2,26).reshape(6,4)
a

array([[ 2,  3,  4,  5],
       [ 6,  7,  8,  9],
       [10, 11, 12, 13],
       [14, 15, 16, 17],
       [18, 19, 20, 21],
       [22, 23, 24, 25]])

In [29]:
df = pd.DataFrame(a)
df

    0   1   2   3
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13
3  14  15  16  17
4  18  19  20  21
5  22  23  24  25

In [30]:
df = pd.DataFrame(a,columns=list('ABCD'))
df

    A   B   C   D
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13
3  14  15  16  17
4  18  19  20  21
5  22  23  24  25

# Some DataFrame properties and some operations

In [31]:
df

    A   B   C   D
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13
3  14  15  16  17
4  18  19  20  21
5  22  23  24  25

In [32]:
# gives total no. of elements present
df.size

24

In [34]:
df.dtypes

A    int32
B    int32
C    int32
D    int32
dtype: object

In [35]:
df.ndim

2

In [36]:
# rows and columns
df.shape

(6, 4)

In [39]:
print(len(df)) # gives no. of rows
print(len(df.columns)) # gives no. of columns

6
4

In [40]:
# if we want values of df in the form of array
df.values

array([[ 2,  3,  4,  5],
       [ 6,  7,  8,  9],
       [10, 11, 12, 13],
       [14, 15, 16, 17],
       [18, 19, 20, 21],
       [22, 23, 24, 25]])

In [44]:
df.__sizeof__() # here it's pure df

224

In [45]:
df.values.__sizeof__() # here it's pure numpy array

120

In [46]:
# check whether my df is empty or not
df.empty

False

In [47]:
g = pd.DataFrame()
print(g)

Empty DataFrame
Columns: []
Index: []

In [48]:
g.empty

True

In [49]:
df.items

<bound method DataFrame.items of     A   B   C   D
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13
3  14  15  16  17
4  18  19  20  21
5  22  23  24  25>

In [50]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [51]:
list(df.index)

[0, 1, 2, 3, 4, 5]

In [52]:
# want top 3 entries==> By default 5 entries
df.head()

    A   B   C   D
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13
3  14  15  16  17
4  18  19  20  21

In [53]:
df.head(3)

    A   B   C   D
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13

In [54]:
# if i want last 3 entries==> By default gives 5
df.tail()

    A   B   C   D
1   6   7   8   9
2  10  11  12  13
3  14  15  16  17
4  18  19  20  21
5  22  23  24  25

In [55]:
df.tail(3)

    A   B   C   D
3  14  15  16  17
4  18  19  20  21
5  22  23  24  25

In [56]:
# generate descriptive statistics
# default it works on numeric data
df.describe()

               A          B          C          D
count   6.000000   6.000000   6.000000   6.000000
mean   12.000000  13.000000  14.000000  15.000000
std     7.483315   7.483315   7.483315   7.483315
min     2.000000   3.000000   4.000000   5.000000
25%     7.000000   8.000000   9.000000  10.000000
50%    12.000000  13.000000  14.000000  15.000000
75%    17.000000  18.000000  19.000000  20.000000
max    22.000000  23.000000  24.000000  25.000000

In [67]:
df[:3]

    A   B   C   D
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13

In [68]:
# fetch 50% data from df
df[:len(df)//2]

    A   B   C   D
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13

In [69]:
len(df)//2 # this is very useful to get half of data

3

In [70]:
# print concise info of df
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      int32
 1   B       6 non-null      int32
 2   C       6 non-null      int32
 3   D       6 non-null      int32
dtypes: int32(4)
memory usage: 224.0 bytes

In [71]:
df = pd.DataFrame([{'a':1},{'a':2,'b':3}])
df

   a    b
0  1  NaN
1  2  3.0

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       2 non-null      int64
 1   b       1 non-null      float64
dtypes: float64(1), int64(1)
memory usage: 160.0 bytes

In [73]:
# it will tell you total missing / NAN values present
df.isnull().sum()

a    0
b    1
dtype: int64

# Selection,Addition and Deletion

In [74]:
a = np.arange(2,26).reshape(6,4)
df = pd.DataFrame(a,columns=list('ABCD'))
df

    A   B   C   D
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13
3  14  15  16  17
4  18  19  20  21
5  22  23  24  25

In [75]:
df['A']  # gives values of column A

0     2
1     6
2    10
3    14
4    18
5    22
Name: A, dtype: int32

In [76]:
type(df['A'])

pandas.core.series.Series

In [77]:
df['A'].ndim

1

# another approach

In [81]:
df.A #==>  df['A']

0     2
1     6
2    10
3    14
4    18
5    22
Name: A, dtype: int32

In [78]:
df.A.ndim

1

# second approach to get df

In [83]:
df[['A']]

    A
0   2
1   6
2  10
3  14
4  18
5  22

In [84]:
type(df[['A']])

pandas.core.frame.DataFrame

In [85]:
df[['A']].ndim

2

## in order to select single column we have 3 options

In [ ]:
df.A ==> Series => 1 dimensional
df['A']==> Series => 1 dimensional
df[['A']] ==> DataFrame => 2 dimensional

In [87]:
# if i want to select more than 1 column
df[['A','B']]

    A   B
0   2   3
1   6   7
2  10  11
3  14  15
4  18  19
5  22  23

In [88]:
df[['C','D']] # when we want single column use single [] bracket
              # if we want two columns or more use [[]] bracket

    C   D
0   4   5
1   8   9
2  12  13
3  16  17
4  20  21
5  24  25

In [89]:
df[['D','B','A']]

    D   B   A
0   5   3   2
1   9   7   6
2  13  11  10
3  17  15  14
4  21  19  18
5  25  23  22

# indexing

In [90]:
# column name acts  as a index
df['A']

0     2
1     6
2    10
3    14
4    18
5    22
Name: A, dtype: int32

# slicing

In [ ]:
[:] # rows
[:,:] # rows and columns
[::,::] # also steping

In [91]:
df[:3]

    A   B   C   D
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13

In [92]:
# fetch even index rows
df[::2]

    A   B   C   D
0   2   3   4   5
2  10  11  12  13
4  18  19  20  21

In [93]:
df[3:]

    A   B   C   D
3  14  15  16  17
4  18  19  20  21
5  22  23  24  25

In [94]:
# we r going to work om columns
[:,:]
# not allowed

SyntaxError: invalid syntax (Temp/ipykernel_11968/2179044456.py, line 2)

#if we are using slicing on df ==> we can fetch only rows==>it wont work similarly on columns

#selection by label/loc[] == > vvimp point

In [95]:
df.loc[:,:]

    A   B   C   D
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13
3  14  15  16  17
4  18  19  20  21
5  22  23  24  25

In [96]:
# i want all rows and only B,D columns
df.loc[:,['B','D']]

    B   D
0   3   5
1   7   9
2  11  13
3  15  17
4  19  21
5  23  25

In [98]:
df.loc[:,'B':'D'] # here stop : is inclusive

    B   C   D
0   3   4   5
1   7   8   9
2  11  12  13
3  15  16  17
4  19  20  21
5  23  24  25

In [99]:
df.loc[:,'B':'C']

    B   C
0   3   4
1   7   8
2  11  12
3  15  16
4  19  20
5  23  24